In [1]:
import pandas as pd
import datetime

In [2]:
file = "../data_cleaning/travel_expenditures.csv"

df = pd.read_csv(file, header=None)
df.dropna(axis=1)
for x in range(120,132):
    del df[x]
df.head()

,0,1,2,3,4,5,6,7,8,9,...,110,111,112,113,114,115,116,117,118,119
0,1/1/2005,2/1/2005,3/1/2005,4/1/2005,5/1/2005,6/1/2005,7/1/2005,8/1/2005,9/1/2005,10/1/2005,...,3/1/2014,4/1/2014,5/1/2014,6/1/2014,7/1/2014,8/1/2014,9/1/2014,10/1/2014,11/1/2014,12/1/2014
1,"$1,620.00","$1,768.00","$1,844.00","$1,987.00","$1,901.00","$1,816.00","$1,721.00","$1,697.00","$1,580.00","$1,640.00",...,"$7,480.00","$7,692.00","$7,871.00","$7,826.00","$8,047.00","$8,142.00","$8,392.00","$8,234.00","$8,163.00","$8,197.00"

In [3]:
df = df.transpose()
df.head()

          0           1
0  1/1/2005  $1,620.00
1  2/1/2005  $1,768.00
2  3/1/2005  $1,844.00
3  4/1/2005  $1,987.00
4  5/1/2005  $1,901.00

In [4]:
df["Year"] = pd.DatetimeIndex(df[0]).year
df["Month"] = pd.DatetimeIndex(df[0]).month
df.columns = ["Date", "Expenditures", "Year", "Month"]
df.head()

       Date Expenditures  Year  Month
0  1/1/2005   $1,620.00   2005      1
1  2/1/2005   $1,768.00   2005      2
2  3/1/2005   $1,844.00   2005      3
3  4/1/2005   $1,987.00   2005      4
4  5/1/2005   $1,901.00   2005      5

In [5]:
df.to_csv("../data_cleaning/cleaned_travel_expenditures.csv")